vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN235_DFP.pdsc
    <condition id="component.els_pkc.els_header_only.condition_id">
      <require condition="allOf.device=MCXN235.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples.condition_id">
      <require condition="allOf.anyOf=allOf=anyOf=device_id=MCXN235, component.els_pkc.examples_random_modes, component.els_pkc, component.els_pkc.els, component.els_pkc.examples_aead, component.els_pkc.examples_cipher_modes, component.els_pkc.examples_ecc, component.els_pkc.examples_els, component.els_pkc.examples_flow_protection, component.els_pkc.examples_hash_modes, component.els_pkc.examples_hmac, component.els_pkc.examples_key, component.els_pkc.examples_mac_modes, component.els_pkc.examples_memory, component.els_pkc.examples_rsa, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pkc, component.els_pkc.random_modes, component.els_pkc.session.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=anyOf=device_id=MCXN235, component.els_pkc.examples_random_modes, component.els_pkc, component.els_pkc.els, component.els_pkc.examples_aead, component.els_pkc.examples_cipher_modes, component.els_pkc.examples_ecc, component.els_pkc.examples_els, component.els_pkc.examples_flow_protection, component.els_pkc.examples_hash_modes, component.els_pkc.examples_hmac, component.els_pkc.examples_key, component.els_pkc.examples_mac_modes, component.els_pkc.examples_memory, component.els_pkc.examples_rsa, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pkc, component.els_pkc.random_modes, component.els_pkc.session.internal_condition">
      <require condition="anyOf.allOf=anyOf=device_id=MCXN235, component.els_pkc.examples_random_modes.internal_condition"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_main"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_els"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_aead"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_cipher"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_ecc"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_els"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_flow_protection"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_hash_modes"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_hmac"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_key"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_mac_modes"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_memory"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_rsa"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_pkc"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_random_modes"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_session"/>
    </condition>
    <condition id="anyOf.allOf=anyOf=device_id=MCXN235, component.els_pkc.examples_random_modes.internal_condition">
      <accept condition="allOf.anyOf=device_id=MCXN235, component.els_pkc.examples_random_modes.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MCXN235, component.els_pkc.examples_random_modes.internal_condition">
      <require condition="anyOf.device_id=MCXN235.internal_condition"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_random_modes"/>
    </condition>
    <condition id="component.els_pkc.examples_aead.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.padding, component.els_pkc.session, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.padding, component.els_pkc.session, device=MCXN235.internal_condition">
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_els"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_padding"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_session"/>
      <require condition="device.MCXN235.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples_cipher_modes.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MCXN235.internal_condition">
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_els"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_session"/>
      <require condition="device.MCXN235.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples_ecc.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples_els.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples_flow_protection.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples_hash_modes.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MCXN235.internal_condition"/>
    </condition>
