vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN235_DFP.pdsc
    <condition id="component.els_pkc.signature.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MCXN235.internal_condition">
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MCXN235.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.standalone_gdet.condition_id">
      <require condition="allOf.component.els_pkc.els_header_only, component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.els_header_only, component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN235.internal_condition">
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_els_header_only"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require condition="device.MCXN235.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.static_lib.mcxn.condition_id">
      <require condition="allOf.anyOf=device_id=MCXN235.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.toolchain.condition_id">
      <require condition="allOf.device=MCXN235.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.trng.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN235.internal_condition">
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require condition="device.MCXN235.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.trng.type_els.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.trng, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.els, component.els_pkc.trng, device=MCXN235.internal_condition">
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_els"/>
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_trng"/>
      <require condition="device.MCXN235.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.trng.type_rng4.condition_id">
      <require condition="allOf.component.els_pkc.trng, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.trng, device=MCXN235.internal_condition">
      <require Cclass="MCXN235 els_pkc" Cgroup="els_pkc_trng"/>
      <require condition="device.MCXN235.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9544.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9548.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="component.eth_phy_common.condition_id">
      <require condition="allOf.driver.common, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=MCXN235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXN235.internal_condition"/>
    </condition>
    <condition id="component.flash_adapter.condition_id">
      <require condition="allOf.anyOf=allOf=component.mcxw_flash_adapter, driver.romapi, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.mcxw_flash_adapter, driver.romapi, device=MCXN235.internal_condition">
      <require condition="anyOf.allOf=component.mcxw_flash_adapter, driver.romapi.internal_condition"/>
      <require condition="device.MCXN235.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.mcxw_flash_adapter, driver.romapi.internal_condition">
      <accept condition="allOf.component.mcxw_flash_adapter, driver.romapi.internal_condition"/>
    </condition>
    <condition id="allOf.component.mcxw_flash_adapter, driver.romapi.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mcxw_flash_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
    </condition>
    <condition id="component.gpio_adapter.condition_id">
      <require condition="allOf.anyOf=driver.port, driver.gpio, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.port, driver.gpio, device=MCXN235.internal_condition">
      <require condition="anyOf.driver.port.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="device.MCXN235.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.port.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
    </condition>
    <condition id="component.i2c_adapter_interface.condition_id">
      <require condition="allOf.anyOf=allOf=anyOf=driver.lpflexcomm_lpi2c, component.lpi2c_adapter, allOf=component.i3c_adapter, driver.i3c, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=anyOf=driver.lpflexcomm_lpi2c, component.lpi2c_adapter, allOf=component.i3c_adapter, driver.i3c, device=MCXN235.internal_condition">
      <require condition="anyOf.allOf=anyOf=driver.lpflexcomm_lpi2c, component.lpi2c_adapter, allOf=component.i3c_adapter, driver.i3c.internal_condition"/>
      <require condition="device.MCXN235.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=anyOf=driver.lpflexcomm_lpi2c, component.lpi2c_adapter, allOf=component.i3c_adapter, driver.i3c.internal_condition">
      <accept condition="allOf.anyOf=driver.lpflexcomm_lpi2c, component.lpi2c_adapter.internal_condition"/>
      <accept condition="allOf.component.i3c_adapter, driver.i3c.internal_condition"/>
    </condition>
