vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN235_DFP.pdsc
    <condition id="anyOf.allOf=driver.lpflexcomm_lpi2c, device_id=MCXN235.internal_condition">
      <accept condition="allOf.driver.lpflexcomm_lpi2c, device_id=MCXN235.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpflexcomm_lpi2c, device_id=MCXN235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c"/>
      <require condition="device_id.MCXN235.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpspi.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpflexcomm_lpspi, device_id=MCXN235, device.RTE, device_id=MCXN235, driver.lpflexcomm_lpspi_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpflexcomm_lpspi, device_id=MCXN235, device.RTE, device_id=MCXN235, driver.lpflexcomm_lpspi_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require condition="anyOf.allOf=driver.lpflexcomm_lpspi, device_id=MCXN235.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MCXN235.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpflexcomm_lpspi, device_id=MCXN235.internal_condition">
      <accept condition="allOf.driver.lpflexcomm_lpspi, device_id=MCXN235.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpflexcomm_lpspi, device_id=MCXN235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device_id.MCXN235.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpuart.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpflexcomm_lpuart, device_id=MCXN235, device.RTE, device_id=MCXN235, driver.lpflexcomm_lpuart_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpflexcomm_lpuart, device_id=MCXN235, device.RTE, device_id=MCXN235, driver.lpflexcomm_lpuart_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpflexcomm_lpuart, device_id=MCXN235.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MCXN235.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpflexcomm_lpuart, device_id=MCXN235.internal_condition">
      <accept condition="allOf.driver.lpflexcomm_lpuart, device_id=MCXN235.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpflexcomm_lpuart, device_id=MCXN235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device_id.MCXN235.internal_condition"/>
    </condition>
    <condition id="driver.codec.condition_id">
      <require condition="allOf.device=MCXN235.internal_condition"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.device=MCXN235.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm33.condition_id">
      <require condition="cores.cm33.internal_condition"/>
    </condition>
    <condition id="cores.cm33.internal_condition">
      <accept Dcore="Cortex-M33"/>
    </condition>
    <condition id="driver.crc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN235.internal_condition"/>
    </condition>
    <condition id="driver.cs42448.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.cs42448_adapter, driver.codec, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.cs42448_adapter, driver.codec, device=MCXN235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42448_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXN235.internal_condition"/>
    </condition>
    <condition id="driver.cs42888.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.cs42888_adapter, driver.codec, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.cs42888_adapter, driver.codec, device=MCXN235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXN235.internal_condition"/>
    </condition>
    <condition id="driver.ctimer.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN235.internal_condition"/>
    </condition>
    <condition id="driver.dbi.condition_id">
      <require condition="allOf.driver.video-common, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="driver.dbi_flexio_edma.condition_id">
      <require condition="allOf.driver.dbi, driver.flexio_mculcd, driver.flexio_mculcd_edma, device=MCXN235.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dbi, driver.flexio_mculcd, driver.flexio_mculcd_edma, device=MCXN235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_mculcd"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_mculcd_edma"/>
      <require condition="device.MCXN235.internal_condition"/>
    </condition>
