vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN235_DFP.pdsc
    <component Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples" Cversion="1.9.0" condition="component.els_pkc.examples.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="doc" name="components/els_pkc/component.els_pkc.examples_dummy.txt"/>
      </files>
    </component>
    <component Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_aead" Cversion="1.9.0" condition="component.els_pkc.examples_aead.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClAeadModes/mcuxClAeadModes_Els_Ccm_Aes128_Multipart_example.c" projectpath="component/els_pkc/examples/mcuxClAeadModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClAeadModes/mcuxClAeadModes_Els_Ccm_Aes128_Oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClAeadModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClAeadModes/mcuxClAeadModes_Els_Gcm_Aes128_Oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClAeadModes"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_cipher" Cversion="1.9.0" condition="component.els_pkc.examples_cipher_modes.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Cbc_Aes128_Multipart_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Cbc_Aes128_Oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Cbc_Aes128_Oneshot_PaddingZero_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Ctr_Aes128_Multipart_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Ctr_Aes128_Oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Ecb_Aes128_Multipart_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Ecb_Aes128_Multipart_PaddingPKCS7_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Ecb_Aes128_Oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Ecb_Aes128_Oneshot_PaddingPKCS7_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Ecb_Aes128_Oneshot_PaddingZero_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_ecc" Cversion="1.9.0" condition="component.els_pkc.examples_ecc.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEcc/mcuxClEcc_EdDSA_Ed25519ctx_example.c" projectpath="component/els_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEcc/mcuxClEcc_EdDSA_Ed25519ph_example.c" projectpath="component/els_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEcc/mcuxClEcc_EdDSA_Ed25519_example.c" projectpath="component/els_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEcc/mcuxClEcc_EdDSA_GenerateSignature_Ed25519_example.c" projectpath="component/els_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEcc/mcuxClEcc_EdDSA_VerifySignature_Ed25519_example.c" projectpath="component/els_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEcc/mcuxClEcc_MontDH_Curve25519_example.c" projectpath="component/els_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEcc/mcuxClEcc_MontDH_Curve448_example.c" projectpath="component/els_pkc/examples/mcuxClEcc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
