vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN235_DFP.pdsc
    <component Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_hmac" Cversion="1.9.0" condition="component.els_pkc.examples_hmac.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClHmac/mcuxClHmac_Els_Oneshot_External_Key_example.c" projectpath="component/els_pkc/examples/mcuxClHmac"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClHmac/mcuxClHmac_Sw_Multipart_example.c" projectpath="component/els_pkc/examples/mcuxClHmac"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClHmac/mcuxClHmac_Sw_Oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClHmac"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_key" Cversion="1.9.0" condition="component.els_pkc.examples_key.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClKey/mcuxClKey_example.c" projectpath="component/els_pkc/examples/mcuxClKey"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_mac_modes" Cversion="1.9.0" condition="component.els_pkc.examples_mac_modes.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClMacModes/mcuxClMacModes_Els_Cbcmac_Aes128_Oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClMacModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClMacModes/mcuxClMacModes_Els_Cbcmac_Aes256_Multipart_PaddingZero_example.c" projectpath="component/els_pkc/examples/mcuxClMacModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClMacModes/mcuxClMacModes_Els_Cmac_Aes128_Oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClMacModes"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_memory" Cversion="1.9.0" condition="component.els_pkc.examples_memory.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxCsslMemory/mcuxCsslMemory_Clear_example.c" projectpath="component/els_pkc/examples/mcuxCsslMemory"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxCsslMemory/mcuxCsslMemory_Compare_example.c" projectpath="component/els_pkc/examples/mcuxCsslMemory"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxCsslMemory/mcuxCsslMemory_Copy_example.c" projectpath="component/els_pkc/examples/mcuxCsslMemory"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxCsslMemory/mcuxCsslMemory_Set_example.c" projectpath="component/els_pkc/examples/mcuxCsslMemory"/>
        <file category="header" name="components/els_pkc/examples/mcuxCsslMemory/inc/mcuxCsslMemory_Examples.h" projectpath="component/els_pkc/examples/mcuxCsslMemory/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_random_modes" Cversion="1.9.0" condition="component.els_pkc.examples_random_modes.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_CtrDrbg_AES256_DRG3_example.c" projectpath="component/els_pkc/examples/mcuxClRandomModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_CtrDrbg_AES256_DRG4_example.c" projectpath="component/els_pkc/examples/mcuxClRandomModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_CtrDrbg_AES256_ELS_example.c" projectpath="component/els_pkc/examples/mcuxClRandomModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_Different_Sessions_example.c" projectpath="component/els_pkc/examples/mcuxClRandomModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_PatchMode_CtrDrbg_AES256_DRG3_example.c" projectpath="component/els_pkc/examples/mcuxClRandomModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_TestMode_CtrDrbg_AES256_DRG4_example.c" projectpath="component/els_pkc/examples/mcuxClRandomModes"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN235 els_pkc" Cgroup="els_pkc_examples_rsa" Cversion="1.9.0" condition="component.els_pkc.examples_rsa.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRsa/mcuxClRsa_sign_NoEncode_example.c" projectpath="component/els_pkc/examples/mcuxClRsa"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRsa/mcuxClRsa_sign_pss_sha2_256_example.c" projectpath="component/els_pkc/examples/mcuxClRsa"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRsa/mcuxClRsa_verify_NoVerify_example.c" projectpath="component/els_pkc/examples/mcuxClRsa"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRsa/mcuxClRsa_verify_pssverify_sha2_256_example.c" projectpath="component/els_pkc/examples/mcuxClRsa"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
