vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN235_DFP.pdsc
    <component Cclass="MCXN235 els_pkc" Cgroup="els_pkc_flow_protection" Cversion="1.9.0" condition="component.els_pkc.flow_protection.condition_id">
      <description>Component els_pkc.flow_protection</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection.h" projectpath="component/els_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_Cfg.h" projectpath="component/els_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_FunctionIdentifiers.h" projectpath="component/els_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_Impl.h" projectpath="component/els_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_SecureCounter_Common.h" projectpath="component/els_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_SecureCounter_Local.h" projectpath="component/els_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN235 els_pkc" Cgroup="els_pkc_glikey" Cversion="1.9.0" condition="component.els_pkc.glikey.condition_id">
      <description>Component glikey</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClGlikey/src/mcuxClGlikey.c" projectpath="component/els_pkc/src/comps/mcuxClGlikey/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClGlikey/inc/mcuxClGlikey.h" projectpath="component/els_pkc/src/comps/mcuxClGlikey/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClGlikey/inc/internal/mcuxClGlikey_SfrAccess.h" projectpath="component/els_pkc/src/comps/mcuxClGlikey/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClGlikey/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClGlikey/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN235 els_pkc" Cgroup="els_pkc_hash" Cversion="1.9.0" condition="component.els_pkc.hash.condition_id">
      <description>Component els_pkc.hash</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHash/src/mcuxClHash_api_multipart_common.c" projectpath="component/els_pkc/src/comps/mcuxClHash/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHash/src/mcuxClHash_api_multipart_compute.c" projectpath="component/els_pkc/src/comps/mcuxClHash/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHash/src/mcuxClHash_api_oneshot_compute.c" projectpath="component/els_pkc/src/comps/mcuxClHash/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHash/src/mcuxClHash_Internal.c" projectpath="component/els_pkc/src/comps/mcuxClHash/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/mcuxClHash.h" projectpath="component/els_pkc/src/comps/mcuxClHash/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/mcuxClHash_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClHash/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/mcuxClHash_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClHash/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/mcuxClHash_Types.h" projectpath="component/els_pkc/src/comps/mcuxClHash/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/internal/mcuxClHash_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClHash/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/internal/mcuxClHash_Internal_Memory.h" projectpath="component/els_pkc/src/comps/mcuxClHash/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClHash/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClHash/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN235 els_pkc" Cgroup="els_pkc_hashmodes" Cversion="1.9.0" condition="component.els_pkc.hashmodes.condition_id">
      <description>Component els_pkc.hashmodes</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHashModes/src/mcuxClHashModes_Core_c_sha1.c" projectpath="component/els_pkc/src/comps/mcuxClHashModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHashModes/src/mcuxClHashModes_Core_els_sha2.c" projectpath="component/els_pkc/src/comps/mcuxClHashModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHashModes/src/mcuxClHashModes_Internal_c_sha1.c" projectpath="component/els_pkc/src/comps/mcuxClHashModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHashModes/src/mcuxClHashModes_Internal_els_sha2.c" projectpath="component/els_pkc/src/comps/mcuxClHashModes/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/mcuxClHashModes.h" projectpath="component/els_pkc/src/comps/mcuxClHashModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/mcuxClHashModes_Algorithms.h" projectpath="component/els_pkc/src/comps/mcuxClHashModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/mcuxClHashModes_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClHashModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/mcuxClHashModes_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClHashModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Core_c_sha1.h" projectpath="component/els_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Core_els_sha2.h" projectpath="component/els_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Internal_els_sha2.h" projectpath="component/els_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Internal_Memory.h" projectpath="component/els_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClHashModes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClHashModes/inc/internal/"/>
      </files>
    </component>
