vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN235_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nb_fw" Cversion="1.0.0" condition="component.wifi_bt_module.nb_fw.condition_id">
      <description>Narrow band firmware</description>
      <RTE_Components_h>
#ifndef CONFIG_BT_IND_DNLD
#define CONFIG_BT_IND_DNLD 1
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.nb_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tx_pwr_limits" Cversion="1.0.0" condition="component.wifi_bt_module.tx_pwr_limits.condition_id">
      <description>Wi-Fi module Tx power limits</description>
      <files>
        <file category="header" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/wlan_txpwrlimit_cfg_WW.h" projectpath="component/wifi_bt_module/AzureWave/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/wlan_txpwrlimit_cfg_WW_rw610.h" projectpath="component/wifi_bt_module/AzureWave/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_1XK_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_1ZM_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_2EL_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_NH.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/u-blox/tx_pwr_limits/wlan_txpwrlimit_cfg_jody_w5_WW.h" projectpath="component/wifi_bt_module/u-blox/tx_pwr_limits"/>
        <file category="include" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/"/>
        <file category="include" name="components/wifi_bt_module/Murata/tx_pwr_limits/"/>
        <file category="include" name="components/wifi_bt_module/u-blox/tx_pwr_limits/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_combo_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_bt_combo_fw.condition_id">
      <description>Wi-Fi/BT combo firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_BT_CMOBO_DNLD
        #define CONFIG_WIFI_BT_CMOBO_DNLD
        #endif
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 0
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 0
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_bt_combo_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_fw.condition_id">
      <description>Wi-Fi firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 1
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_nb_combo_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_nb_combo_fw.condition_id">
      <description>wifi_nb_combo firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 0
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 0
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_nb_combo_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524_adapter" Cversion="2.2.0" condition="component.wm8524_adapter.condition_id">
      <description>Component wm8524 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.h" projectpath="codec/port/wm8524"/>
        <file category="sourceC" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.c" projectpath="codec/port/wm8524"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8524/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="component.wm8904_adapter.condition_id">
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.h" projectpath="codec/port/wm8904"/>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.c" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8904/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.2.0" condition="component.wm8960_adapter.condition_id">
      <description>Component wm8960 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.h" projectpath="codec/port/wm8960"/>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.c" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8960/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter" Cversion="2.2.0" condition="component.wm8962_adapter.condition_id">
      <description>Component wm8962 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.h" projectpath="codec/port/wm8962"/>
        <file category="sourceC" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.c" projectpath="codec/port/wm8962"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8962/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXN235_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXN235_cmsis</description>
      <files>
        <file category="header" name="devices/MCXN235/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MCXN235/MCXN235.h" projectpath="device"/>
        <file category="header" name="devices/MCXN235/MCXN235_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXN235/MCXN235_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_ADC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_AHBSC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_CAN.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_CDOG.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_CMC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_CRC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_CTIMER.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_DIGTMP.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_DM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_DMA.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_EIM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_ERM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_EVTG.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_EWM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_FLEXIO.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_FMU.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_FMUTEST.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_FREQME.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_GDET.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_GPIO.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_I2S.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_I3C.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_INPUTMUX.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_INTM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_ITRC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_LPCMP.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_LPI2C.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_LPSPI.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_LPTMR.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_LPUART.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_LP_FLEXCOMM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_MRT.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_NPX.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_OSTIMER.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_OTPC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_PDM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_PINT.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_PKC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_PORT.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_PUF.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_PWM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_QDC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_RTC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_S50.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_SCG.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_SMARTDMA.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_SPC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_SYSCON.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_SYSPM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_TRDC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_USBHS.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_USBHSDCD.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_USBNC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_USBPHY.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_UTICK.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_VBAT.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_VREF.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_WUU.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXN235/periph1/PERI_WWDT.h" projectpath="device/periph1"/>
        <file category="include" name="devices/MCXN235/"/>
        <file category="include" name="devices/MCXN235/periph1/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXN235/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXN235/template/"/>
      </files>
    </component>
