vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN235_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXN235_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXN235_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXN235.condition_id" category="linkerScript" name="devices/MCXN235/arm/MCXN235_flash.scf" projectpath="MCXN235/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MCXN235.condition_id" category="linkerScript" name="devices/MCXN235/arm/MCXN235_ram.scf" projectpath="MCXN235/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXN235.condition_id" category="linkerScript" name="devices/MCXN235/gcc/MCXN235_flash.ld" projectpath="MCXN235/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXN235.condition_id" category="linkerScript" name="devices/MCXN235/gcc/MCXN235_ram.ld" projectpath="MCXN235/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXN235.condition_id" category="linkerScript" name="devices/MCXN235/iar/MCXN235_flash.icf" projectpath="MCXN235/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXN235.condition_id" category="linkerScript" name="devices/MCXN235/iar/MCXN235_ram.icf" projectpath="MCXN235/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MCXN235" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MCXN235</description>
      <files>
        <file category="header" attr="config" name="devices/MCXN235/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN235/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXN235/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN235/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXN235/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN235/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXN235/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN235/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXN235/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MCXN235_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MCXN235/iar/startup_MCXN235.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MCXN235/gcc/startup_MCXN235.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MCXN235/arm/startup_MCXN235.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXN235_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MCXN235_system</description>
      <files>
        <file category="sourceC" name="devices/MCXN235/system_MCXN235.c" projectpath="device"/>
        <file category="header" name="devices/MCXN235/system_MCXN235.h" projectpath="device"/>
        <file category="include" name="devices/MCXN235/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_lpcac" Cversion="2.2.0" condition="driver.cache_lpcac_n4a_mcxn.condition_id">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN235/drivers/fsl_cache_lpcac.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN235/drivers/fsl_cache_lpcac.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common" Cversion="1.0.0" condition="driver.camera-common.condition_id">
      <description>Driver camera-common</description>
      <files>
        <file category="header" name="components/video/camera/fsl_camera.h" projectpath="video"/>
        <file category="include" name="components/video/camera/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common" Cversion="1.0.0" condition="driver.camera-device-common.condition_id">
      <description>Driver camera-device-common</description>
      <files>
        <file category="header" name="components/video/camera/device/fsl_camera_device.h" projectpath="video"/>
        <file category="include" name="components/video/camera/device/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov5640" Cversion="1.0.1" condition="driver.camera-device-ov5640.condition_id">
      <description>Driver camera-device-ov5640</description>
      <files>
        <file category="header" name="components/video/camera/device/ov5640/fsl_ov5640.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ov5640/fsl_ov5640.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ov5640/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov7670" Cversion="1.0.2" condition="driver.camera-device-ov7670.condition_id">
      <description>Driver camera-device-ov7670</description>
      <files>
        <file category="header" name="components/video/camera/device/ov7670/fsl_ov7670.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ov7670/fsl_ov7670.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ov7670/"/>
      </files>
    </component>
