vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN235_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="itrc" Cversion="2.4.0" condition="driver.itrc.condition_id">
      <description>itrc Driver</description>
      <files>
        <file category="header" name="devices/MCXN235/drivers/fsl_itrc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN235/drivers/fsl_itrc.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpadc" Cversion="2.9.3" condition="driver.lpadc.condition_id">
      <description>LPADC Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN235/drivers/fsl_lpadc.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN235/drivers/fsl_lpadc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_freqme" Cversion="2.1.2" condition="driver.lpc_freqme.condition_id">
      <description>lpc_freqme Driver</description>
      <files>
        <file category="header" name="devices/MCXN235/drivers/fsl_freqme.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN235/drivers/fsl_freqme.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpcmp" Cversion="2.3.2" condition="driver.lpcmp.condition_id">
      <description>LPCMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN235/drivers/fsl_lpcmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN235/drivers/fsl_lpcmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpflexcomm" Cversion="2.2.1" condition="driver.lpflexcomm.condition_id">
      <description>LPFLEXCOMM Driver</description>
      <files>
        <file category="header" name="devices/MCXN235/drivers/fsl_lpflexcomm.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN235/drivers/fsl_lpflexcomm.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c" Cversion="2.2.6" condition="driver.lpflexcomm_lpi2c.condition_id">
      <description>LPI2C Driver</description>
      <files>
        <file category="header" name="devices/MCXN235/drivers/fsl_lpi2c.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN235/drivers/fsl_lpi2c.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c_edma" Cversion="2.0.1" condition="driver.lpflexcomm_lpi2c_edma.condition_id">
      <description>LPI2C EDMA Driver</description>
      <files>
        <file category="header" name="devices/MCXN235/drivers/fsl_lpi2c_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN235/drivers/fsl_lpi2c_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi" Cversion="2.2.9" condition="driver.lpflexcomm_lpspi.condition_id">
      <description>LPSPI Driver</description>
      <files>
        <file category="header" name="devices/MCXN235/drivers/fsl_lpspi.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN235/drivers/fsl_lpspi.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma" Cversion="2.1.4" condition="driver.lpflexcomm_lpspi_edma.condition_id">
      <description>LPSPI EDMA Driver</description>
      <files>
        <file category="header" name="devices/MCXN235/drivers/fsl_lpspi_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN235/drivers/fsl_lpspi_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart" Cversion="2.3.4" condition="driver.lpflexcomm_lpuart.condition_id">
      <description>LPUART Driver</description>
      <files>
        <file category="header" name="devices/MCXN235/drivers/fsl_lpuart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN235/drivers/fsl_lpuart.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma" Cversion="2.0.0" condition="driver.lpflexcomm_lpuart_edma.condition_id">
      <description>LPUART EDMA Driver</description>
      <files>
        <file category="header" name="devices/MCXN235/drivers/fsl_lpuart_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN235/drivers/fsl_lpuart_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr" Cversion="2.2.1" condition="driver.lptmr.condition_id">
      <description>LPTMR Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN235/drivers/fsl_lptmr.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN235/drivers/fsl_lptmr.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lsm6dso" Cversion="1.0.0" condition="driver.lsm6dso.condition_id">
      <description>Driver lsm6dso</description>
      <files>
        <file category="header" name="components/sensor/lsm6dso/fsl_lsm.h" projectpath="tilt_pedo"/>
        <file category="sourceC" name="components/sensor/lsm6dso/fsl_lsm.c" projectpath="tilt_pedo"/>
        <file category="include" name="components/sensor/lsm6dso/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="max30101" Cversion="1.0.0" condition="driver.max30101.condition_id">
      <description>Driver max30101</description>
      <files>
        <file category="header" name="components/sensor/max30101/fsl_max.h" projectpath="heartrate"/>
        <file category="sourceC" name="components/sensor/max30101/fsl_max.c" projectpath="heartrate"/>
        <file category="include" name="components/sensor/max30101/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mcx_cmc" Cversion="2.3.0" condition="driver.mcx_cmc.condition_id">
      <description>MCX_CMC Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN235/drivers/fsl_cmc.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN235/drivers/fsl_cmc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mcx_spc" Cversion="2.8.1" condition="driver.mcx_spc.condition_id">
      <description>MCX SPC Driver</description>
      <files>
        <file category="header" name="devices/MCXN235/drivers/fsl_spc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN235/drivers/fsl_spc.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mcx_vbat" Cversion="2.3.1" condition="driver.mcx_vbat.condition_id">
      <description>MCX VBAT Driver</description>
      <files>
        <file category="header" name="devices/MCXN235/drivers/fsl_vbat.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN235/drivers/fsl_vbat.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mem_interface" Cversion="2.0.0" condition="driver.mem_interface.condition_id">
      <description>ROMAPI MEM_INTERFACE Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN235/drivers/romapi/mem_interface/src/fsl_mem_interface.c" projectpath="drivers/mem_interface/src"/>
        <file category="header" name="devices/MCXN235/drivers/romapi/mem_interface/fsl_mem_interface.h" projectpath="drivers/mem_interface"/>
        <file category="header" name="devices/MCXN235/drivers/romapi/mem_interface/fsl_sbloader.h" projectpath="drivers/mem_interface"/>
        <file category="header" name="devices/MCXN235/drivers/romapi/mem_interface/fsl_sbloader_v3.h" projectpath="drivers/mem_interface"/>
        <file category="include" name="devices/MCXN235/drivers/romapi/mem_interface/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8451q" Cversion="1.0.0" condition="driver.mma8451q.condition_id">
      <description>Driver mma8451q</description>
      <files>
        <file category="header" name="components/sensor/mma8451q/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/mma8451q/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/sensor/mma8451q/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8652fc" Cversion="1.0.0" condition="driver.mma8652fc.condition_id">
      <description>Driver mma8652fc</description>
      <files>
        <file category="header" name="components/sensor/mma8652fc/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/mma8652fc/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/sensor/mma8652fc/"/>
      </files>
    </component>
